### Part 1 : EDA 
<ul><li>For completing the reports 1 and reports 2</li>
    <li>Getting better understanding of the data to help create better models</li>
    <li>Report 1 - Survivors by class, age band and gender</li> 
    <li>Report 2 - Count of survivors by State</li> 
 </ul>

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data/titanic.csv')

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.5+ KB

In [5]:
df.describe(include='all')

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887,887,887.000000,887.000000,887.000000,887.00000
unique,NaN,NaN,887,2,NaN,NaN,NaN,NaN
top,NaN,NaN,Mr. George Bradley,male,NaN,NaN,NaN,NaN
freq,NaN,NaN,1,573,NaN,NaN,NaN,NaN
mean,0.385569,2.305524,NaN,NaN,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,NaN,NaN,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,NaN,NaN,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,512.32920

#### A. Report 1

In [6]:
# Survivors by class
df[df['Survived']==1].groupby(['Survived','Pclass'])['Survived'].count().to_cs

Survived  Pclass
1         1         136
          2          87
          3         119
Name: Survived, dtype: int64

In [7]:
# Survivors by age band
df[df['Survived']==1].groupby(['Survived','Age'])['Survived'].count()

Survived  Age
1         0.42      1
          0.67      1
          0.75      2
          0.83      2
          0.92      1
          1.00      5
          2.00      4
          3.00      5
          4.00      8
          5.00      4
          6.00      2
          7.00      2
          8.00      2
          9.00      2
          11.00     1
          12.00     1
          13.00     2
          14.00     3
          15.00     4
          16.00     7
          17.00     6
          18.00    13
          19.00    11
          20.00     4
          21.00     6
          22.00    15
          23.00     7
          24.00    18
          25.00     7
          26.00     7
                   ..
          32.50     1
          33.00     8
          34.00     7
          35.00    12
          36.00    11
          37.00     3
          38.00     6
          39.00     5
          40.00     7
          41.00     3
          42.00     8
          43.00     1
          44.00     3
          45.00     6
          46.00     2
          47.00     2
          48.00     9
          49.00     4
          50.00     5
          51.00     2
          52.00     3
          53.00     1
          54.00     3
          55.00     1
          56.00     2
          58.00     3
          60.00     2
          62.00     2
          63.00     2
          80.00     1
Name: Survived, Length: 66, dtype: int64

Now we can see that this is very difficult to interprest and probably not what we want. We need to bin the age, max age is 80, choosing binSize = 5 should be ideal.

In [8]:
df1 = df.copy()
df1['Age Band'] = pd.cut(df1['Age'], np.arange(0, 80.0, 5))

In [9]:
df1.head(5)

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,Age Band
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500,"(20.0, 25.0]"
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833,"(35.0, 40.0]"
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,"(25.0, 30.0]"
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,"(30.0, 35.0]"
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,"(30.0, 35.0]"

In [10]:
df1[df1['Survived']==1].groupby(['Survived','Age Band'])['Survived'].count()

Survived  Age Band
1         (0.0, 5.0]      33
          (5.0, 10.0]      8
          (10.0, 15.0]    11
          (15.0, 20.0]    41
          (20.0, 25.0]    53
          (25.0, 30.0]    51
          (30.0, 35.0]    48
          (35.0, 40.0]    32
          (40.0, 45.0]    21
          (45.0, 50.0]    22
          (50.0, 55.0]    10
          (55.0, 60.0]     7
          (60.0, 65.0]     4
Name: Survived, dtype: int64

In [11]:
# Survivors by gender
df[df['Survived']==1].groupby(['Survived','Sex'])['Survived'].count()

Survived  Sex
1         female    233
          male      109
Name: Survived, dtype: int64

#### B. Report 2
NOTE - For report 2, what is state? there is not description of the state?
is it same as the class, what has to be considered?

### Part 2 : Data Cleaning/ Feature Engineering

### Part 3 : Predictive Modelling 
<ul><li>Create a predictive model of survivors using Spark ML
    </li>
    <li>Determine fewest number of dimensions from the dataset to arrive at a statiscally relevant result</li>
</ul>

### Part 4 : Evaluation and Results
<ul><li>Report 3 - Test your model and show performance against actual
    </li></ul>